[{"skills": ["Python", "Machine Learning", "Natural Language Processing", "SQL", "Tableau", "Database Systems", "Data Analytics"], "location": "", "role_type": "Full-Time", "interested_roles": ["Data Analyst", "Data Scientist"], "industries": ["Healthcare", "Customer Segmentation Marketing"], "remote": "Flexible", "team_fit": "I would excel at a diverse team that has a great culture and significant impact to business.", "summary": "Currently seeking Full time Data Analyst roles starting January 2024. Expertise domain knowledge in healthcare and customer segmentation marketing. Python, Machine Learning, Natural Language Processing, SQL, Tableau, Database Systems, Data Analytics. I enjoy programming, working with ML models, and visualizing patterns to get the most value out of data. I graduated with a Bachelor’s in Computer Engineering from University of Mumbai in 2018. As for my future, I aspire to one day work as a Data Scientist with a diverse team that has a great culture and significant impact to business. In my free time, I love to watch space documentaries and cook"}, {"skills": ["cybersecurity", "computer languages", "platforms", "tools"], "location": "US", "role_type": "Full-Time", "interested_roles": ["Cybersecurity Analyst", "National Security Specialist", "Infrastructure Security Engineer"], "industries": ["Federal Government", "Defense", "Intelligence"], "remote": "Flexible", "team_fit": "This individual would excel in a team that values collaboration, adaptability, and continuous learning. Their strong motivation and expertise in cybersecurity would make them a valuable asset to any organization focused on protecting critical infrastructure.", "summary": "I am a MS in Cybersecurity student at Northeastern University who is interested in the cybersecurity of infrastructure and its intersection with cyber-warfare and national security. I am a highly motivated worker who has experience working with a wide range of computer languages, platforms, and tools. I am currently participating in the CyberCorps®: Scholarship for Service program, run by the U.S. Office of Personnel Management, and have committed to working to strengthen the cybersecurity of the US government following my graduation."}, {"skills": ["Python", "C++", "Java", "R", "SQL", "Keras", "PyTorch", "Tensorflow", "Flask", "FastAPI", "AWS", "Azure", "Docker", "NATS", "Git", "Jira"], "location": "Flexible", "role_type": "Flexible", "interested_roles": ["Machine Learning Engineer", "Research Scientist", "AI Researcher"], "industries": ["Healthcare Technology", "Education Technology", "Supply Chain"], "remote": "Flexible", "team_fit": "This person would excel at a team that values innovation, collaboration, and open communication. They thrive in environments where they can share their expertise with others and learn from them in return.", "summary": "As a Machine Learning Engineer at Chegg, I apply my passion and expertise in Generative AI, Natural Language Processing, and Deep Learning to develop state-of-the-art AI applications that empower students and educators. I have built deep learning models for question answering, topic prediction, and author extraction, leveraging LLMs, CNNs, and traditional ML models. I am currently working on CheggMate, a revolutionary AI-powered study assistant that powers student learning experiences and helps them master any subject. I have a Master of Science in Computer Science, specializing in Artificial Intelligence, from Northeastern University, where I gained a solid foundation in Deep Learning, Machine Learning, Computer Vision, and Natural Language Processing. I also have 2.5 years of experience in Research and Applied AI in Healthcare, EdTech, and supply chain, working with fast-paced startups and prominent Big Tech corporations. I have strong skills in Python, C++, Java, R, SQL, Keras, PyTorch, Tensorflow, Flask, FastAPI, AWS, Azure, Docker, NATS, Git, Jira, and more. I am an avid learner, conscious of the latest trends in AI and technology, and I enjoy giving tech talks and sharing my insights with the community."}, {"skills": ["software engineering", "data science", "machine learning", "distributed computing", "data storage"], "location": "Flexible", "role_type": "Full-Time", "industries": ["Finance", "Technology"], "remote": "Flexible", "team_fit": "This person would excel at a team that values innovation, collaboration, and continuous learning. They are drawn to teams that prioritize solving complex problems using data-driven approaches.", "interested_roles": ["Senior Data Scientist", "Data Engineer", "Machine Learning Engineer"], "summary": "With over six years of experience as a software engineer and a master's degree in data science, I have developed a strong foundation in both technical and analytical skills. I am currently working as a software engineer III at JPMorgan Chase & Co., where I apply my knowledge of machine learning, distributed computing, and data storage to design and implement solutions for the financial sector. Previously, I worked as a senior software developer at The D.E. Shaw Group, a hedge fund known for its quantitative and technology-driven approach. There, I was part of the Quant Data team that handled large volumes of financial data from various sources and platforms. I also interned as a software development engineer at Amazon, where I contributed to the development of a web service that optimized the delivery of digital content. In addition, I have completed several certifications and courses in data science, machine learning, and statistics, as well as a teaching assistant and research assistant role at Northeastern University. I am passionate about learning new technologies and exploring new domains, and I am always eager to take on new challenges and opportunities."}, {"skills": ["Software Engineering", "Data Science", "Java", "Python", "PHP", "C++", "JavaScript", "TypeScript", "R", "HTML/CSS", "MySQL", "OracleSQL", "MongoDB", "SQLite", "AWS RDS", "DynamoDB", "Apache Cassandra", "SpringBoot", "React.js", "Node.js", "jQuery", "Hibernate", "Flask", "GraphQL", "Scikit-learn", "Keras", "Git", "JUnit4"], "location": "", "role_type": "Flexible", "interested_roles": ["Software Engineer", "Data Scientist", "Data Engineer"], "industries": ["Healthcare Technology", "Finance Technology", "Education Technology"], "remote": "Flexible", "team_fit": "This person would excel in a team that values collaboration, creativity, and adaptability. They would thrive in an environment where they can work on diverse projects, apply their technical skills, and continuously learn from others.", "summary": "Creative and results-oriented software engineer with 2+ years of experience working with tech companies. Experienced with all stages of the development cycle for dynamic web and ML projects and agile development principles. I like to work on databases, backend and frontend technologies and frameworks, DevOps, implementing and designing product lifecycles and data pipelines. In the realm of deep learning and machine learning, I've worked on natural language processing, computer vision, and unsupervised machine learning, applying these techniques to solve real-world problems. My hands-on experience with tools and technologies such as Docker, Kubernetes, Apache Flink, Kafka, and various AWS services has equipped me to build scalable and efficient systems. Currently looking for Software Engineering and Data Science roles starting immediately. Redhat Certified System Administrator (RHCSA). Languages: Java, Python, PHP, C++, JavaScript, TypeScript, R, HTML/CSS. Databases: MySQL, OracleSQL, MongoDB, SQLite, AWS RDS, DynamoDB, Apache Cassandra. Frameworks: SpringBoot, React.js, Node.js, jQuery, Hibernate, Flask, GraphQL, Sklearn, Keras, Git, Junit4. Tools and Technologies: REST API, Postman, Docker, Kubernetes, Apache Flink, Kafka, Rockset, AWS S3."}, {"skills": ["Data Science", "Business Administration", "Social Innovation and Entrepreneurship"], "location": "Flexible", "role_type": "Internship", "interested_roles": ["Data Analyst", "Business Intelligence Analyst", "Operations Research Analyst"], "industries": ["Finance", "Technology"], "remote": "Flexible", "team_fit": "This individual would excel in a team that values innovation, collaboration, and data-driven decision making. They thrive in environments that encourage creativity, experimentation, and continuous learning.", "summary": "I am a graduating senior at Northeastern studying Data Science & Business Administration, with a concentration in social innovation and entrepreneurship. Currently searching for Summer 2024 internships in Tech and Finance before returning to Northeastern as a graduate student to complete a Masters in Data Science as part of the PlusOne program."}, {"skills": ["machine learning", "deep neural networks", "machine learning algorithms", "programming"], "location": "New England", "role_type": "Flexible", "interested_roles": ["Research Scientist", "Data Scientist", "Artificial Intelligence Engineer"], "industries": ["Biotechnology"], "remote": "Flexible", "team_fit": "This person would excel at a team that values innovation, collaboration, and open communication. Their expertise in machine learning and AI would be highly valued in a team focused on developing cutting-edge solutions for complex biological problems.", "summary": "I am a machine learning researcher at New England Biolabs, where I apply my skills in deep neural networks, machine learning algorithms, and programming to develop and deploy solutions for biological problems. I am also a Master's student in Electrical and Computer Engineering at Northeastern University, with a focus on Computer Vision and Deep Learning. Current Research: Active Learning; Explainable and Interpretable AI"}, {"skills": ["Data Scientist", "Machine Learning", "Python", "R", "Scala", "SQL", "C", "C++", "MATLAB", "SciKit-Learn", "NumPy", "Pandas", "SciPy", "Matplotlib", "Seaborn", "TensorFlow", "Keras", "OpenCV", "Spacy", "Polyglot"], "location": "", "role_type": "Flexible", "interested_roles": ["Machine Learning Engineer", "Data Scientist", "Research Scientist"], "industries": ["Healthcare Technology", "Finance Technology", "Education Technology"], "remote": "Flexible", "team_fit": "A team that values collaboration, creative problem-solving, and continuous learning. A person who would excel in this team is someone who is detail-oriented, persistent, and passionate about making a meaningful impact.", "summary": "A graduate student with 2 years of work experience as a Data Scientist. Started this journey in the field of Machine Learning, during my internship where I built a Robokeeper. I'm passionate, detail-oriented and persistent. I wanted to build my career in the field of Machine Learning because it allows an individual to explore different domains. Technical Skills : Programming Languages: Python, R, Scala, SQL, C, C++, MATLAB. Libraries: SciKit-Learn, NumPy, Pandas, SciPy, Matplotlib, Seaborn, TensorFlow, Keras, OpenCV, Spacy, Polyglot. Tools: Amazon EMR, Apache Spark, Apache Hadoop, MongoDB, Jupyter Notebook, R studio, Tableau, PowerBI, JIRA, Git"}, {"skills": ["Machine Learning", "ML Operations", "Keras", "Tensorflow (core, JS, Lite)", "Scikit-Learn", "Computer Vision", "Web Development", "Django", "Flask", "CI/CD", "Python/C/C++/Java", "Cloud Tech (AWS, Azure, GCP)"], "location": "Massachusetts", "role_type": "Full-Time", "interested_roles": ["Software Engineer", "Data Scientist", "ML/DL Engineer"], "industries": ["Education Technology", "Healthcare Technology", "Finance Technology"], "remote": "Flexible", "team_fit": "This person would excel at a team that values fast-paced environments, tight deadlines, and rapid iteration. They would thrive in a collaborative setting where they can bring their strong problem-solving skills to the table.", "summary": "I have 3 years of experience in building Machine Learning/Deep Learning applications (web/mobile/edge) and designing pipelines for end-to-end ML deployments (ML Ops). Currently I'm pursuing my Masters Degree at Northeastern University (Boston, US), on track to graduate in May 2024 with a major in Computer Science. I have a keen eye for the product and user experience/requirements when designing a product. I have worked in fast-paced work-environments with tight deadlines and I learned that I pick-up new technologies quickly which helps me iterate through prototypes faster. I can add great value to your ML Team and help build new experiences for your consumers. I'm seeking Full-time Software Engineering roles (in Data Science/ML/DL/ML Ops) starting August 2024. Feel free to message me :) Competencies: Machine Learning, ML Operations, Keras, Tensorflow (core, JS, Lite), Scikit-Learn, Computer Vision, Web Development, Django, Flask, CI/CD, Python/C/C++/Java, Cloud Tech (AWS, Azure, GCP) Accomplishments: Winner at HackHarvard Hackathon '22 for 'Best use of Google Cloud'."}, {"skills": ["C++", "Python", "Java", "Angular", "Django", "Flask"], "location": "Massachusetts", "role_type": "Flexible", "interested_roles": ["Software Engineer", "Product Developer", "Data Scientist"], "industries": ["Business", "Climate Change"], "remote": "Flexible", "team_fit": "A team that values innovation, collaboration, and making a positive impact on the world. This person would excel in a team that is passionate about building products that bring value to customers.", "summary": "I am a graduate student pursuing Computer Science at Northeastern University, Boston. I am self-motivated, hard-working, passionate about, and excited to learn new technologies. Prior to joining, Northeastern, I worked as Software Engineer at Teradata R&D, building some cool Advanced Analytics packages for our customers. My top skills include C++, Python, Java, Angular, Django, Flask. I’m passionate about building products that bring a positive impact to the world, from a business application to one that fights climate change."}, {"skills": ["Data Science", "Data Analytics", "Machine Learning"], "location": "Flexible", "role_type": "Full-Time", "interested_roles": ["Data Scientist", "Business Intelligence Analyst", "Quantitative Analyst"], "industries": ["Healthcare Technology", "Financial Services", "Education Technology"], "remote": "Flexible", "team_fit": "A team that values innovation, collaboration, and a passion for using data to drive positive change. A team that is open to new ideas and willing to challenge the status quo.", "summary": "I am an MS in Data Science graduate, and I have a passion for using data to solve complex real-world problems. I have gained experience in the Data Science field through internships using data analytics and machine learning frameworks. Additionally, I have contributed to publications related to data science and am constantly looking for ways to expand my knowledge and skills. I am eager to explore opportunities in the industry to apply my skills and make a positive impact. I believe that data science has the potential to transform industries and create new opportunities, and I am excited to be a part of this change."}, {"skills": ["Python", "Tableau", "R", "SQL", "Machine Learning", "Data Warehousing", "Cloud Computing"], "location": "Flexible", "role_type": "Full-Time", "interested_roles": ["Data Scientist", "Data Analyst", "Data Engineer"], "industries": [], "remote": "Flexible", "team_fit": "This person would excel in a team that values creativity, innovation, and business acumen, and provides opportunities for personal and professional development.", "summary": "As a highly motivated individual, I am constantly seeking opportunities to gain real-world experience and expand my skill set. My passion for data science and analytics led me to pursue a career in this field. My experience with Python, Tableau, R, SQL, and other data analysis tools, combined with my expertise in machine learning, data warehousing, and cloud computing, would enable me to thrive in a dynamic environment. I am always eager to learn and explore new technologies, and I believe in using data to drive insights and make informed decisions. With strong analytical thinking and interpersonal skills, I am confident in my ability to collaborate effectively with mentors and professionals to develop new skills that will benefit me in the long term. I am detail-oriented and thrive in a dynamic environment that challenges me to think critically and adapt quickly. My ultimate goal is to grow within a company that values creativity, innovation, and business acumen, and provides opportunities for personal and professional development. I am excited about the prospect of joining a team that shares my passion for data and is dedicated to using it to drive positive change. If you are looking for a highly driven and dedicated Data Scientist/Analyst/Engineer, I would love to connect and explore potential opportunities together."}, {"skills": ["Python", "Java", "R", "JavaScript", "PL/SQL", "Django", "Spring Boot", "Kubernetes", "Apache Spark", "MapReduce", "Hive", "Kafka", "NumPy", "Pandas", "TensorFlow", "Matplotlib", "Scikit-learn"], "location": "Flexible", "role_type": "Flexible", "interested_roles": ["Software Engineer", "Data Scientist", "DevOps Engineer"], "industries": ["Education Technology", "Finance", "Healthcare"], "remote": "Flexible", "team_fit": "A team that values innovation, collaboration, and technical expertise. This individual thrives in a fast-paced environment where they can apply their skills to drive progress and solve complex problems.", "summary": "With 4+ years of experience in both software and data engineering, I have contributed to significant projects in various capacities. My work spans from enhancing data ingestion and automation at Addgene, reducing CI/CD pipeline failures at KPMG, to deploying AI models at Flip Robo Technologies with high accuracy. Notably, at Evolutionary Systems, I took the lead in implementing a scalable HRMS solution on OCI’s Kubernetes Engine and developed EvoGlide—a tool that revolutionized the data migration process. I am committed to merging disciplined software development with advanced data engineering practices to drive progress and innovation. Programming Languages: Python, Java, R, JavaScript, PL/SQL. Frameworks: Django, Spring Boot, Kubernetes, Apache Spark, MapReduce, Hive, Kafka, NumPy, Pandas, TensorFlow, Matplotlib, Scikit-Learn. Tools & Technologies: Node, React, Kubernetes, Git, Jenkins, jQuery, HTML, CSS, XPath, AWS Redshift, Tableau, Jupyter."}, {"skills": ["Data Science", "Machine Learning", "Data Analytics", "Data Visualization", "Natural Language Processing", "Computer Vision", "R", "Python", "SQL"], "location": "", "role_type": "Flexible", "interested_roles": ["Data Engineer", "Data Scientist", "Business Intelligence Analyst"], "industries": ["Education Technology", "Finance", "Marketing"], "remote": "Flexible", "team_fit": "This person would excel at a team that values collaboration, innovation, and problem-solving. They thrive in environments where they can leverage their technical skills to drive business impact and continuously learn from diverse perspectives.", "summary": "Having completed my Master's degree in Data Science from Northeastern University, I am an aspiring data scientist with a passion for applying machine learning and data analytics to solve real-world problems. My education has equipped me with a solid foundation in data visualization, natural language processing, computer vision, and other relevant topics, as demonstrated by my projects such as Resume Parser and Job Similarity Scoring and Predicting Depression, Stress, and Anxiety Scores. I also have valuable work experience as a Data Engineer Coop at Wayfair. I developed a self-healing dedupe functionality for their data pipeline in Google BigQuery, which increased the Service Level Objective meetup from 86% to 92%. Additionally, I designed and built ETL procedures, data models, and Looker dashboards for FinTech and Loyalty in the Strategic Programs Team, and supported the data needs of over 100 business stakeholders across various marketing channels. Previously, I worked as a Data Science Intern at Prayaas Corps and Navlakhi Education, where I built databases, implemented predictive models, and developed a recommendation system using SQL, Python, and XGBoost. I am proficient in R, Python, SQL, and data visualization tools such as Tableau, PowerBI, and Looker. I am eager to learn new skills and technologies, and to collaborate with diverse and talented teams. My career goal is to leverage my skills and experience to work on meaningful projects that make a positive impact on society, and to grow as a data science professional and leader."}, {"skills": ["Angular", "Spring Boot", "Core Java", "TypeScript", "JavaScript", "Azure", "AWS"], "location": "", "role_type": "Flexible", "interested_roles": ["Software Engineer", "Full Stack Developer", "Backend Developer"], "industries": ["Information Technology", "Education Technology"], "remote": "Flexible", "team_fit": "This person would excel in a team that values collaboration, problem-solving, and innovative thinking. They would thrive in an environment where they can take ownership of projects, work closely with other developers, and contribute to the development of high-quality software.", "summary": "Software Engineer with an experience of 4 years working as a Full Stack developer. Skilled in Angular , Spring Boot, Core Java, TypeScript, and JavaScript and cloud technologies like Azure and AWS. Interested in web development, system design, software design and database design."}, {"skills": ["Full-stack development", "Software engineering", "Java", "Python", "JavaScript", "MySQL", "ElasticSearch"], "location": "Northeastern University (assuming this is a hint, but not explicitly stated, so I'll say Flexible)", "role_type": "Flexible", "industries": [], "remote": "Flexible", "team_fit": "I would excel in a team that values innovation, collaboration, and agility. As someone who is passionate about technology, I thrive in environments where I can share ideas, work effectively with others, and drive positive results.", "interested_roles": ["Software Engineer", "Full-Stack Developer", "Backend Developer"], "summary": "As a Master of Science in Computer Science student from Northeastern University's Khoury College of Computer Sciences, I bring a strong foundation in programming and a passion for developing innovative solutions. With experience in both full-stack development and software engineering, I have honed my skills in languages such as Java, Python, and JavaScript, as well as databases like MySQL and ElasticSearch. Throughout my professional experiences, I have consistently demonstrated my ability to work effectively in an agile environment and collaborate with cross-functional teams to drive positive results. I am eager to leverage my technical skills and passion for technology to make a meaningful impact in a new role, starting from May 2023."}, {"skills": ["Data Science", "Coding"], "location": "Flexible", "role_type": "Flexible", "interested_roles": ["Business Intelligence Analyst", "Data Analyst", "Data Scientist"], "industries": [], "remote": "Flexible", "team_fit": "A team that values innovation, creativity, and collaboration. A team that is willing to take calculated risks and is passionate about exploring new ideas.", "summary": "Adventurous soul exploring the intersections of data and innovation. Data Science graduate with a penchant for unraveling patterns and insights. From crafting code to wandering the world, I find beauty in the details and thrive on challenges. Let's connect and share our journeys!"}, {"skills": ["Java", "C++", "Python", "Android development"], "location": "Flexible", "role_type": "Full-Time", "interested_roles": ["Software Engineer", "Android Developer", "Kubernetes Engineer"], "industries": ["Education Technology", "Transportation", "Technology"], "remote": "Flexible", "team_fit": "This person would excel in a team that values technical expertise, collaboration, and innovative problem-solving. They thrive in environments where they can leverage their skills to deliver impactful results and are willing to take on new challenges.", "summary": "I am a software engineer with 4+ years of experience in building highly scalable software and Android development experience.I have previous experience as a software engineer at Amazon, Zipcar, and Google Summer of Code, where I built highly scalable and secure systems using cutting-edge technologies such as AWS, Kafka, RxJava, Docker, and Kubernetes. I have demonstrated my ability to deliver impactful results, such as reducing latency by 85%, processing and charging 10,000+ user violations daily, and saving $1+ million annually. I have strong skills in Java, C++, Python, and Android development."}, {"skills": ["Java", "SpringBoot micro- services", "Hibernate", "Angular", "JavaScript"], "location": "Northeastern University", "role_type": "Flexible", "interested_roles": ["Senior Software Engineer", "Software Development Manager", "DevOps Engineer"], "industries": ["Computer Software Industry"], "remote": "Flexible", "team_fit": "This individual would excel at a team that values innovation, collaboration, and continuous learning. They would thrive in an environment where they can leverage their technical expertise to drive business outcomes.", "summary": "An experienced Senior Software Engineer with a demonstrated history of working in the computer software industry. Skilled in Java, SpringBoot micro-services, Hibernate, Angular, and JavaScript. Strong engineering professional pursuing a graduate degree in Computer Science from Northeastern University."}, {"skills": ["Customer-centric mindset", "Data-driven", "Software Professional", "Innovative products", "Agile/TDD practices", "Logical reasoning"], "location": "Flexible", "role_type": "Full-Time", "industries": ["Financial Services", "Healthcare Technology", "Retail Technology"], "remote": "Flexible", "team_fit": "A high-performing, innovative team that values collaboration, customer-centricity, and continuous learning. They would thrive in a fast-paced environment with opportunities to drive technical excellence and process improvement.", "interested_roles": ["Software Development Manager", "Product Owner", "DevOps Engineer"], "summary": "Customer-centric mindset, data-driven Software Professional with 7+ years of experience in building innovative products, and optimizing their performance. Well-versed with the entire development life cycle and facilitating agile/TDD practices. Strong exposure to the different business functionalities while working in various business-complex use cases. Highly acknowledged for logical reasoning and frequently awarded with the highest performance rating for consistently exceeding expectations and going the extra mile."}, {"skills": ["Machine Learning", "Deep Learning", "Computer Vision"], "location": "Flexible", "role_type": "Flexible", "interested_roles": ["Model Deployment Specialist", "Machine Learning Engineer", "Data Scientist"], "industries": ["Healthcare", "Finance", "Retail"], "remote": "Flexible", "team_fit": "This person would excel at a team that values collaboration, creativity, and continuous learning. They would thrive in an environment where they can leverage their technical expertise to drive business results.", "summary": "As a machine learning enthusiast with a deep understanding of Machine Learning, Deep Learning, and Computer Vision, I am passionate about using my skills to solve real-world problems. I have experience building and deploying models in a variety of industries, including healthcare, finance, and retail. I am constantly learning and staying up to date with the latest developments in the field. I am looking for opportunities to apply my skills and continue to grow as a professional in the machine learning industry. If you are looking for a dedicated and knowledgeable individual to help take your company's ML initiatives to the next level, please don't hesitate to connect with me."}, {"skills": ["Data Science", "Machine Learning Engineering", "Data Engineering", "R", "Python", "SQL"], "location": "Flexible", "role_type": "Full-Time", "interested_roles": ["Data Scientist", "Machine Learning Engineer", "Data Engineer"], "industries": [], "remote": "Flexible", "team_fit": "A team that values data-driven insights and innovation, with a strong culture of collaboration and experimentation.", "summary": "As a recent Data Science graduate from Northeastern University, I am actively seeking opportunities in the fields of Data Science, Machine Learning Engineering, and Data Engineering. My strong mathematical foundation, programming skills, and inclination towards Machine Learning have been honed through practical experiences in data manipulation, analysis, and visualization using R, Python, and SQL. My background includes hands-on experience with cloud services like AWS and Google Cloud. I am passionate about uncovering patterns in data to derive meaningful insights, contributing to the growth and innovation of organizations."}, {"skills": ["Angular", "AWS", "GCP"], "location": "Flexible", "role_type": "Full-Time", "interested_roles": ["Cloud Engineer", "Software Developer", "Data Scientist"], "remote": "Flexible", "team_fit": "This person would excel at a team that values innovation, collaboration, and continuous learning. They would thrive in an environment where they can share their expertise with others, learn from their peers, and work on projects that have a significant impact.", "industries": ["Various", "Education Technology", "Social"], "summary": "As a Cloud Engineer, I have a passion for developing and deploying scalable and reliable data solutions using cutting-edge technologies. I am currently pursuing a Master of Science in Computer Science at Northeastern University, where I have also been a Teaching Assistant for CS3200, a course on database design and implementation. I have over 2 years of work experience in various roles, including Cloud Engineer at Deloitte, where I helped design and build cloud-based applications and infrastructure for clients across different industries, and Manager at AIESEC, where I led a team of volunteers to organize and execute social projects and events. I have multiple certifications in software development, Java programming, and probability and data, and I have skills in Angular, AWS, and GCP. I am also the founder of CSKL, a student-run advisory council that connects technology clubs and student societies at KL University, where I graduated with honors in Computer Science. My goal is to leverage my skills and education to create impactful and innovative data solutions that can transform businesses and society."}, {"skills": ["MERN Stack", "OpenCV", "UI-UX", "Backend development"], "location": "Boston", "role_type": "Flexible", "interested_roles": ["Software Engineer", "DevOps Engineer", "Full Stack Developer"], "industries": ["Automotive Technology", "Technology Services", "Government Projects"], "remote": "Flexible", "team_fit": "A team that values innovation, collaboration, and continuous learning. This person would excel in a team that is open to new ideas, willing to take calculated risks, and has a strong culture of mentorship and knowledge sharing.", "summary": "I am passionate about learning and applying new technologies to solve real-world problems. I have completed multiple projects and internships in various domains, such as automation, web development, blockchain, and mobile applications, using MERN Stack, OpenCV, etc. Some of my notable experiences include working as a winter intern at Honda Cars India Ltd, where I worked on their website and mobile application's UI-UX and on their workflows, and as a summer intern at NEC Technologies India Pvt Ltd, where I worked with the backend development team for a government project. I graduated from Vellore Institute of Technology with a bachelor's degree in ECE in 2021. Currently pursuing my Master's of Science in Computer Science at Northeastern University, Boston, where my GPA is 4.0/4.0. I am also working as a Teaching Assistant for the course CS 2810 - Mathematics of Data Models under Prof. Almudena Konrad. In addition to my academic pursuits, I am actively engaged in AWS and cloud technologies, currently preparing for the associate developer AWS exam. I look forward to connecting with you and exploring new opportunities."}, {"skills": ["Artificial Intelligence", "Data Analytics", "Algorithms", "Machine Learning"], "location": "Massachusetts", "role_type": "Full-Time", "interested_roles": ["Data Scientist", "AI Engineer", "Quantitative Analyst"], "industries": ["Healthcare Technology", "Education Technology", "Finance Technology"], "remote": "Flexible", "team_fit": "This individual would excel in a collaborative and innovative team that values data-driven decision making, experimentation, and continuous learning. They thrive in environments where they can share their passion for AI and machine learning with like-minded individuals.", "summary": "I am currently a junior enrolled in the Northeastern University Honors Program pursuing a Bachelor's of Science in Computer Science along with a minor in Mathematics. I intend on concentrating in artificial intelligence and am passionate about data analytics, algorithms, and machine learning and their applications in various industries."}, {"skills": ["Data Science", "Machine Learning", "Statistics", "Artificial Intelligence", "Natural Language Processing"], "location": "Flexible", "role_type": "Full-Time", "interested_roles": ["Data Scientist", "Machine Learning Engineer", "AI Researcher"], "industries": ["Education Technology", "Software Development", "Patent Analysis"], "remote": "Flexible", "team_fit": "This person would excel at a team that values innovative problem-solving, collaboration, and hands-on learning. They would thrive in an environment where they can leverage their skills to drive business impact and continuously learn from others.", "summary": "I love solving problems. With a Master's in Artificial Intelligence from Northeastern University and a background in engineering, I have a strong foundation in data science, advanced machine learning, and statistics. As a Data Scientist at Pontoon Solutions, I modernized and improved the Supplier Recommendation Engine. This engine aggregates high-dimensional structured data and resolves the complex business problem of redundancy in vendor management. It helps clients condense their supplier base by 66%% for optimal and manageable performance. I leveraged agile methods to develop applications based on best coding practices and integrate Azure services. I also have experience as a Graduate Teaching Assistant at Khoury College of Computer Sciences. I led the Teaching Assistance Staff in orchestrating course content, schedule, assignment grading, and support for 120+ students pursuing the Introduction to Data Mining and Machine Learning course. I have leveraged my skills in Natural Language Processing to automate internal workflows such as semantic document filtering, reducing research hours for Patent Analysts by 24 hours. I'm a relentless learner, thriving on hands-on challenges and guided mentorship. My toolkit includes Python, R, PyTorch, Power BI, and Azure Services, and I'm always expanding my horizons. My passion lies in uncovering hidden insights within growing data stores and using those to build impactful machine-learning models that transform businesses. If you're seeking an AI enthusiast driven to crack open new possibilities and unlock your data's potential, let's connect!"}, {"skills": ["Python", "SQL", "PyTorch", "Numpy", "Pandas", "Plotly"], "location": "Flexible", "role_type": "Full-Time", "interested_roles": ["Data Scientist", "Machine Learning Engineer", "Natural Language Processing Specialist"], "industries": ["Healthcare Technology", "Education Technology", "Research and Development"], "remote": "Flexible", "team_fit": "This person would excel in a team that values collaboration, innovation, and problem-solving. They thrive in environments where data-driven insights drive decision-making and where they can apply cutting-edge NLP and ML techniques to solve complex challenges.", "summary": "I am an AI Master's student with a strong focus on Natural Language Processing (NLP) and Machine Learning (ML). I have completed several projects and internships related to these domains, such as the Data Science Internship at LG Vertech, where I conducted predictive analysis to detect weak batteries and optimize operational efficiency. I am proficient in Python, SQL, and ML frameworks such as PyTorch, and I have a solid foundation in statistical analysis and data visualization. As a Graduate Student Researcher at Northeastern University, I work with mHealth research lab to perform data analysis and visualization on large-scale accelerometer data from the NHANES survey. Using Python libraries such as Pandas, Numpy, and Plotly, I manipulate and understand the data distribution, and identify outliers and anomalies. This experience has enhanced my skills in unstructured data, exploratory data analysis, and data wrangling. I am passionate about applying cutting-edge NLP and ML techniques to solve real-world challenges and drive impactful outcomes. Let's collaborate and unleash the power of data!"}]